#include "MSP430G2553.h"
//-----在main()函数前提前申明子函数-----

void GPIO_Init();									//GPIO初始化函数


void main(void) {
	WDTCTL = WDTPW + WDTHOLD;	//关闭看门狗定时器
	GPIO_Init();											//初始化GPIO

	while(1)
	{
		__delay_cycles(1000000);				//与CPU时钟相关的长延时
		P1OUT ^= BIT0;								//LED亮灭状态改变
		P1OUT ^= BIT6;								//LED亮灭状态改变
	}
}
/******************************************************************************************************
 * 名       称：GPIO_Init()
 * 功       能：设定按键和LED控制IO的方向，启用按键IO的上拉电阻
 * 入口参数：无
 * 出口参数：无
 * 说       明：无
 * 范       例：无
 ******************************************************************************************************/
void GPIO_Init()
{
	//-----设定P1.0和P1.6的输出初始值-----
	P1DIR |= BIT0+BIT6;							//设定P1.0为输出
	P1OUT |= BIT0;						//设定P1.0初值
	P1OUT &= (~BIT6);
}
